{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title","getFn":null},{"path":["body"],"id":"body","weight":1,"src":"body","getFn":null}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Yoela's Garden","n":0.707},"1":{"v":"\nWelcome to my digital garden! What's that? Well, a digital garden is a curated set of notes, often shared online for learning and sharing purposes. My garden is mostly full of my study notes, plain ole' random notes, prose, and whatever world I'm creating at the moment. So, yes, I'm tending to it nearly every day.\n\nWith that out of the way, just a fair warning, not everything in this garden will make sense to you. There are some sections that are… shall we say, little buds that need a bit more watering and time before they're big enough to actually portray their species. To help you (and me) figure out the growth status of a page, there are emojis on every one that show their current state within the garden.\n","n":0.088}}},{"i":2,"$":{"0":{"v":"Templates","n":1}}},{"i":3,"$":{"0":{"v":"Character","n":1}}},{"i":4,"$":{"0":{"v":"27 Chapter Outline","n":0.577},"1":{"v":"## Outline\n\n### Act 1 - Setup\n\n#### Block 1 - Introducing the Main Characters\n\n##### 1. INTRODUCTION - Intro to Set up Their Ordinary World\n\n...\n\n##### 2. INCIDENT - Inciting Incident to Start of the Story\n\n...\n\n##### 3. FALL OUT - Immediate Reaction to the Incident\n\n...\n\n#### Block 2 - Life Gets Disrupted\n\n##### 4. REACTION - MC Reacts & Reflects on Long-term Impacts\n\n...\n\n##### 5. ACTION - MC Takes Action\n\n...\n\n##### 6. CONSEQUENCE - Immediate Consequences of MC’s Actions\n\n...\n\n#### Block 3 - Time to Change\n\n##### 7. PRESSURE - MC’s Life Has Changed, Creating Pressure & Stress\n\n...\n\n##### 8. PLOT TWIST - The First Pinch or Plot Twist Occurs\n\n...\n\n##### 9. PUSH → - Due to the Plot Twist, the MC is Pushed into the New World\n\n...\n\n### Act 2 - Conflict\n\n#### Block 4 - Settle into New World\n\n##### 10. NEW WORLD - Intro to the New World. What’s Changed? MC’s Feelings?\n\n...\n\n##### 11. FUN & GAMES - MC Takes a Break, Has a Little Fun\n\n...\n\n##### 12. JUXTAPOSITION - Comparison between the past World and the Present One\n\n...\n\n#### Block 5 - Main Conflict\n\n##### 13. BUILD UP - Midpoint is Approaching!\n\n...\n\n##### 14. MIDPOINT - The Main Midpoint Conflict\n\n...\n\n##### 15. REVERSAL - Immediate Reaction or Consequence of the Midpoint\n\n...\n\n#### Block 6 - Find the End-goal\n\n##### 16. CONSEQUENCE - MC Reflects on Long-term Impacts of Midpoint\n\n...\n\n##### 17. TRIALS - MC Takes Action, but due to the Enormity of the Task, Stuff Go Wrong\n\n...\n\n##### 18. DEDICATED - Despite Setbacks, MC Decides to Succeed no Matter what\n\n....\n\n### Act 3 - Resolution\n\n#### Block 7 - Darkest Moment\n\n##### 19. CALM BEFORE THE STORM - Stuff Seem to Calm Down, but the Tension is Still there\n\n...\n\n##### 20. PLOT TWIST - MC Experiences Something Completely Unexpected\n\n...\n\n##### 21. DARKEST MOMENT - Success Seems Impossible\n\n...\n\n#### Block 8 - Motivated\n\n##### 22. POWER WITHIN - MC Remembers Their Desire to Succeed & Finds Their Inner Power\n\n...\n\n##### 23. ACTION/RALLY - MC Takes Action, Plot Lines Begin to Converge\n\n...\n\n##### 24. CONVERGE - The Final Battle is Approaching!\n\n...\n\n#### Block 9 - Finale\n\n##### 25. BATTLE - The Finale! MC Has One Last Battle\n\n...\n\n##### 26. CLIMAX - MC Takes Action to Resolve the Problem from the Midpoint\n\n...\n\n##### 27. RESOLUTION - Immediate Reaction to MC’s Decision\n\n...\n","n":0.053}}},{"i":5,"$":{"0":{"v":"Worldbuilding","n":1},"1":{"v":"## World Overview**\n\n* **Title**: Briefly describe the world, its tone, and genre (e.g., fantasy, science fiction, historical).\n* **Setting**: Define the world's geographical scope, climate, and environmental features (e.g., continents, oceans, mountains, deserts).\n* **Timeframe**: Establish the world's temporal context, including its history, current era, and potential future developments.\n\n## II. Magic System\n\n* **Origin**: How did magic come to be in this world? Was it always present, or did it emerge at a specific point in history?\n* **Types**: Describe the different forms of magic, their limitations, and potential consequences (e.g., elemental, arcane, divine).\n* **Users**: Who can wield magic, and under what circumstances? Are there restrictions or requirements for magic use?\n\n## Society and Politics\n\n* **Governance**: Describe the world's governing structures, including monarchies, republics, or other forms of leadership.\n* **Social Hierarchy**: Outline the social classes, castes, or strata within the world, including their relationships and power dynamics.\n* **Economy**: Define the world's economic systems, including trade, commerce, and resource management.\n\n**IV. Culture and Customs**\n\n* **Language**: Describe the dominant languages spoken in the world, including dialects and regional variations.\n* **Art and Architecture**: Outline the world's artistic and architectural styles, including influences and inspirations.\n* **Festivals and Celebrations**: Document the world's cultural events, holidays, and traditions.\n\n**V. Geography and Climate**\n\n* **Landforms**: Describe the world's natural features, including mountains, rivers, forests, and deserts.\n* **Climate Zones**: Outline the world's climate regions, including temperature, precipitation, and weather patterns.\n\n**VI. Creatures and Beings**\n\n* **Native Species**: Describe the world's indigenous flora and fauna, including unique or fantastical creatures.\n* **Magical Beings**: Outline the world's supernatural entities, such as demons, angels, or other magical creatures.\n\n**VII. History**\n\n* **Major Events**: Document significant historical events, including wars, discoveries, and cultural shifts.\n* **Legacy**: Describe how these events have shaped the world's current state and influenced its development.\n\n**VIII. Additional Details**\n\n* **Technology**: Outline the world's technological advancements, including inventions, discoveries, and innovations.\n* **Mythology**: Document the world's mythological stories, legends, and folklore.\n* **Unanswered Questions**: Identify areas where the world's lore is incomplete or uncertain, leaving room for further development and exploration.\n\n[Worldbuilding Template](https://kindlepreneur.com/worldbuilding-template/)\n\n[Worldbuilding: The Ultimate Guide (Plus a Template!)](https://www.scribophile.com/academy/what-is-worldbuilding)\n","n":0.055}}},{"i":6,"$":{"0":{"v":"Ilmaria","n":1},"1":{"v":"Ilmaria is a vast and vibrant fantasy world teeming with magic, ancient wonders, and diverse cultures. From its towering crystal spires to its lush, enchanted forests, Ilmaria captivates the hearts and imaginations of all who traverse its lands. This world is as dangerous as it is beautiful, with mystical creatures and hidden secrets lurking in every corner.\n\nIt's a land of endless adventure and mystery, where magic weaves through every aspect of life and the natural world holds countless secrets. Its diverse landscapes and cultures create a rich tapestry of stories, waiting to be discovered by those brave enough to explore its wonders.\n","n":0.099}}},{"i":7,"$":{"0":{"v":"Magical Systems","n":0.707},"1":{"v":"Magic in Ilmaria is a fundamental part of life, with different regions having their own unique forms of magic:\n\n- **Earth Magic** in the [[Crystalline Peaks]] allows for the manipulation of minerals and gemstones.\n- **Nature Magic** in the [[Eldoria Forests]] connects users with the flora and fauna.\n- **Wind Magic** in the [[Shimmering Isles]] harnesses the power of air and flight.\n- **Water Magic** in the [[Sunken Abyss]] controls the seas and aquatic life.\n- **Fire Magic** in the [[Ashen Wastes]] commands the element of fire and heat.\n","n":0.109}}},{"i":8,"$":{"0":{"v":"Geography","n":1},"1":{"v":"Ilmaria is divided into several distinct regions, each with its own unique landscape and climate:\n\n## Crystalline Peaks\n\nDominated by towering mountains made of translucent crystals, this region glows with an otherworldly light. Home to the reclusive [[Gemfolk]], these peaks are rich in magical minerals that power much of Ilmaria’s arcane technology.\n\n## Eldoria Forests\n\nVast, ancient woodlands filled with towering trees, bioluminescent flora, and mystical creatures. This region is the heartland of the [[Elves]], who live in harmony with nature and guard the ancient secrets of the forest.\n\n## Shimmering Isles\n\nA collection of floating islands above the Coral Sea, connected by magical bridges of light. The [[Aerians]], winged humanoids, inhabit these isles and are known for their mastery of aerial combat and wind magic.\n\n## Sunken Abyss\n\nAn underwater realm with sprawling coral cities and bioluminescent fauna. The cities of the [[Merfolk]] are marvels of bioluminescent architecture. They have an intimate knowledge of the ocean's depths and possess powerful water magic.\n\n## Ashen Wastes\n\nA desolate, volcanic region marked by blackened earth and constant ash storms. This harsh land is home to the [[Fireborn]], a race of beings who thrive in the intense heat and forge powerful weapons from the lava flows.\n\n## Verdant Plains\n\nRolling grasslands and fertile farmlands where the [[Human]] kingdoms flourish. Known for their ingenuity and adaptability, humans here build grand cities and maintain a delicate balance with the surrounding nature.\n\n## Sunaara Deserts\n\nThe Desert of Sunaara, known as the Golden Expanse, is a vast and arid region characterized by its rolling dunes, scorching sun, and hidden oasis. It is a land of ancient ruins, nomadic tribes, and powerful sand magic.\n","n":0.062}}},{"i":9,"$":{"0":{"v":"Sunaara Deserts","n":0.707},"1":{"v":"## Geography\n\nThe Desert of Sunaara spans across the southern reaches of [[Ilmaria]], bordered by the [[Verdant Plains]] to the north and the [[Ashen Wastes]] to the east. Key geographical features include:\n\n- **The Endless Dunes**: Towering sand dunes that shift with the wind, creating an ever-changing landscape.\n- **The Oasis of Lira**: A lush, verdant sanctuary with crystal-clear water, surrounded by palm trees and exotic flora.\n- **The Ruins of Zarim**: Ancient stone structures half-buried in the sand, remnants of a once-great civilization.\n- **The Mirage Canyons**: Deep canyons where the interplay of light and shadow creates mesmerizing illusions.\n\n## Societies and Cultures\n\n- **Nomadic Tribes**: The people of Sunaara are primarily nomadic, moving with the seasons and the availability of water. They are skilled in survival, navigation, and the art of sand magic. Their society is organized into clans, each led by a chieftain who is both a leader and a protector.\n- **The Dune Riders**: A fearless group of warriors and traders who travel the desert on swift sand ships, harnessing the wind to glide across the dunes. They are known for their exceptional combat skills and their ability to navigate the treacherous sands.\n- **The Sand Mages**: Mystics who have mastered the manipulation of sand and wind, capable of summoning sandstorms and shaping the dunes to their will. They are revered for their wisdom and their ability to find hidden oases and ancient relics.\n\n## Magic and Mysticism\n\nSand magic, or **Geomancy**, is the predominant form of magic in Sunaara. Practitioners can manipulate sand, stone, and wind, allowing them to:\n\n- **Create Sandstorms**: Summon and control sandstorms for defense or to obscure enemies.\n- **Shape the Dunes**: Mold sand into structures, weapons, and barriers.\n- **Uncover Hidden Waters**: Sense and access underground water sources.\n- **Illusions and Mirages**: Craft illusions that confuse and mislead foes.\n\n## Mystical Creatures\n\nThe harsh environment of Sunaara is home to unique and resilient creatures:\n\n- **Sand Dragons**: Smaller and more agile than their counterparts, these dragons blend seamlessly with the desert landscape and can burrow through the sand.\n- **Desert Wyrms**: Massive, serpent-like creatures that tunnel beneath the sand, emerging suddenly to snatch prey.\n- **Mirage Spirits**: Ethereal beings that appear as shimmering apparitions in the heat of the desert. They are believed to guard hidden treasures and ancient secrets.\n- **Scarab Beetles**: Enormous, jewel-encrusted beetles that are both revered and feared. They are often seen as omens and are said to possess magical properties.\n\n## Economy and Trade\n\nDespite its arid climate, Sunaara plays a crucial role in Ilmaria's economy. The nomads and traders of Sunaara are known for their:\n\n- **Spices and Incense**: Unique spices and aromatic resins harvested from rare desert plants.\n- **Precious Gems**: Sunaara's sands are rich in precious stones, particularly opals and topaz.\n- **Exotic Silks**: Woven from the threads of desert silk moths, prized for their durability and beauty.\n- **Ancient Relics**: Artifacts and treasures unearthed from the ruins of Zarim, sought after by collectors and scholars.\n\n## Conclusion\n\nThe Desert of Sunaara is a land of extremes, where life thrives against all odds and ancient mysteries lie buried beneath the sands. Its people, creatures, and magic contribute to the rich and diverse tapestry of Ilmaria, offering endless adventures and untold stories for those daring enough to brave its golden expanse.\n","n":0.043}}},{"i":10,"$":{"0":{"v":"Creatures","n":1},"1":{"v":"Ilmaria is home to a myriad of magical creatures, including:\n\n- **Dragons**: Majestic and powerful, dragons are revered and feared. Each region has its own subspecies, adapted to their environment.\n- **Fey**: Mischievous and magical beings that inhabit the forests and glades.\n- **Sea Serpents**: Massive, serpentine creatures that dwell in the deepest parts of the ocean.\n- **Griffins**: Regal creatures with the body of a lion and the wings of an eagle, often seen in the Shimmering Isles.\n- **Fire Elementals**: Living embodiments of flame, found in the Ashen Wastes.\n","n":0.108}}},{"i":11,"$":{"0":{"v":"Study Notes","n":0.707},"1":{"v":"The main courses in school include english , social science, science, foreign language, and humanities.\n\nIn English, you will find courses about literature, grammar, writing, speaking and listening, and vocabulary.\n\nSocial science includes anthropology, economics, and political science. Pretty much the study of the human world.\n\nThat isn't to be confused with science, which covers subjects like life science, mathematics, and the rest of the\nnatural world.\n\nForeign language is pretty easy, popular choices are spanish, french, chinese, japanese, and korean.\n\nSubjects of humanities are religion, philosophy, and history.\n","n":0.11}}},{"i":12,"$":{"0":{"v":"SOC2110 Service Learning","n":0.577},"1":{"v":"## Description\n\nThis is a course in which students participate in service activities outside the classroom that meets identified community needs and complements classroom studies while engaged in classroom learning. Students will reflect on their service activity as a means of gaining a deeper understanding of the course content, a broader appreciation for social action and social problem-solving, and an enhanced sense of civic responsibility.\n\n## Learning Objectives\n\n1. Understand the biblical framework concerning the root causes of poverty and its alleviation.\n2. Identify strategies North American Christians often employ to help the poor and discern their effectiveness.\n3. Impact through participation in social issues that directly affect your community.\n4. Develop logic and critical thinking skills.\n5. Reflect on innovative, tactical, and entrepreneurial methods to support their personal, professional, and civic-related actions.\n6. Gain practical resume-building and vocationally-related skills.\n","n":0.087}}},{"i":13,"$":{"0":{"v":"Project Summary","n":0.707},"1":{"v":"At first, figuring out what to do was difficult. Everyone was confused, and half of us were not very active in the discussions. Getting everyone on a call was even worse, some were working while others had prior engagements, and the other half were MIA during the scheduling. Once we had a leader, things started to move smoothly, but it was still frustrating.\n\nInitially, I was the project leader, and the most frustrating thing for me was that when I finally got everyone on a call, someone would say that what I was trying to do, give out temporary roles, was pointless because we didn't even know what we were doing. But then when we would try to discuss what our project was, there was confusion because most of us didn't understand what to do. Half of us were not reading the document summarizing our current project idea, and the other half were frustrated with trying to organize things and reiterate the project idea to each other. However, all of that changed when Jenna came in and pitched her idea to the group. Of course, there was still a bit of confusion because we didn't understand what our project requirements were, but when that was cleared up, Jenna's idea was perfect.\n\nThe biggest thing that I learned about myself so far is that I'm quick to step in and take the lead because I often get the impression that everyone else is either freaking out or just being quiet on the sidelines. And I'm often told that I do bring a sense of stability when I step in and calm everyone down and get others engaged. That was why I was originally chosen as project leader. However, when it came time for me to step down and trade roles with someone else, I was hesitant to give up my position. At first, I wasn't sure why I was hesitant. I used excuses like \"Jenna can be brash\" or \"everyone is so quick to panic, so why put one of the people who panic in charge?\" As I took a day to think over my reasoning, I realized that the real reason I didn't want to pass on the leadership role was because I myself wasn't sure if I wanted to follow someone like that. Yes, she has potential, and she stepped up quite maturely without trying to shove others aside; but she can be so focused on carrying out what she wants without taking a moment to listen to others. That's when I realized that I was being wrong and unfair to Jenna, so I decided to let her try to foster her leadership potential in a safe environment. And, I let her know that I was there if she needed help. And, so far, she's been great, and I've learned that just because I can lead doesn't mean I need to. I took over her role as the point of contact for the nursing home, and it worked out great. I was able to get all the information we needed at the time and share it with the group in a timely manner.\n","n":0.044}}},{"i":14,"$":{"0":{"v":"REL1010 Introduction to Old Testament","n":0.447},"1":{"v":"## Description\n\nThis course provides an introduction to the theological, historical, and literary features of the Old Testament, tracing God’s covenant relationship with ancient Israel. It is an unforgettable, in-depth journey through all 39 books of the Old Testament. It follows the flow of biblical history from creation to the Transjordan, from the Conquest to the Babylonian Exile, and the Pre-exilic and Exilic Prophets. Special attention is given to how God has always related to his people through covenant–and how grace has been the cornerstone of God’s dealings with humanity since the very beginning. Students gain eye-opening insights into the culture, traditions, and prevailing religious views which enable them to fully grasp the enormity and profundity of Jesus the Messiah’s mind and message.\n\n## Learning Objectives\n\n1. State the basic storyline of the Old Testament and be familiar with the major events, people, and geographical locations of ancient Israel.\n2. Be able to articulate the themes, purpose, and primary message of each individual book of the Old Testament.\n3. Identify the various ways in which the Old Testament testifies about Jesus Christ and grow closer to the Savior by gaining insights into the salvation-historical preparations for his birth, teachings, crucifixion, and resurrection.\n4. Apply interpretive skill to Old Testament readings of different literary genres in light of the major covenants and historical periods.\n5. Trust the Bible, live holy lives, and be evangelists.\n\n### Section 1: From Creation to the Transjordan\n\n1. Identify the basic elements of a Judeo-Christian worldview.\n2. Demonstrate a working knowledge of the visual roadmap of the timeline of the entire biblical narrative.\n3. Demonstrate skill at being able to identify and understand key contributions the Hebrew people have made in the shaping of western civilization with particular emphasis on its moral categories.\n4. Demonstrate an understanding of the important theme of covenant in God’s dealings with His people and creation.\n5. Identify the importance of the Pentateuch in the history of the Hebrew people and Judaism.\n\n### Section 2: From the Conquest to the Babylonian Exile\n","n":0.055}}},{"i":15,"$":{"0":{"v":"PHL1113 Survey of Social Engagement","n":0.447},"1":{"v":"## Description\n\nA primer for thinking and acting Christianly in the cultural arena. A guide for applying a Christian mind to today’s most challenging issues: religious freedom, creation care, euthanasia, abortion, human sexuality, marriage, and more.\n\nThis course is a survey of contemporary social challenges. Students are challenged to think through how an authentic Christian worldview can provide a compassionate, effective witness in our culture today. Lessons from history reveal why today’s issues might not be as new as they seem. This course offers biblical ideas for conversing about significant topics with others in their relations with loved ones, neighbors and colleagues.\n\n## Learning Objectives\n\n1. Analyze the implications of living in a universe that can be observed and how that demonstrates God’s concern for humanity.\n2. Identify reasons for Christians to concern themselves with the surrounding culture.\n3. Understand how answers to metaphysical questions, addressing both the positive and negative aspects of human progress, often lead to cultural conflict.\n4. Identify biblical directives for the attributes Christians ought to pursue when engaging with the culture.\n5. Recognize the consequences ideas have on our actions and the influence decisions have on the world around us.\n","n":0.073}}},{"i":16,"$":{"0":{"v":"Meta Front-End Developer Certificate","n":0.5},"1":{"v":"A 9-course series on Coursera that will launch your career as a front-end developer. Taught by the Meta staff.\n\n## What you'll learn\n\n- Create a responsive website using HTML to structure content, CSS to handle visual style, and JavaScript to develop interactive experiences.\n- Learn Bootstrap CSS Framework to create webpages and work with GitHub repositories and version control.\n- Learn to use React in relation to Javascript libraries and frameworks.\n- Prepare for a coding interview, learn best approaches to problem-solving, and build portfolio-ready projects you can share during job interviews.\n\n## Skills you'll gain\n\n- HTML\n- UI/UX Design\n- JavaScript\n- Cascading Style Sheets (CSS)\n- React\n\n## Courses (7 months, 6 hours a week)\n\n1. Introduction to Front-End Development (18h, 4 modules)\n2. Programming with JavaScript (42h)\n3. Version Control (13h)\n4. HTML and CSS in depth (28h)\n5. React Basics (26h)\n6. Advanced React (26h)\n7. Principles of UX/UI Design (21h)\n8. Front-End Developer Capstone (27h)\n9. Coding Interview Preparation (11h)\n","n":0.083}}},{"i":17,"$":{"0":{"v":"Introduction to Front-End Development","n":0.5},"1":{"v":"## Goals\n\n- Distinguish between front-end. back-end, and full-stack developers.\n- Create and style a webpage with HTML and CSS.\n- The benefits of working with UI frameworks.\n\n## Skills you will gain\n\n- Web Development Tools\n- HTML and CSS\n- Responsive Web Design\n- Front-End Web Development\n- User Interface\n\n## Modules\n\n1. Get started with web development (4h)\n   1. 18 videos\n   2. 11 readings\n   3. 5 quizzes\n   4. 1 discussion prompt\n2. Introduction to HTML and CSS (6h)\n   1. 12 videos\n   2. 6 readings\n   3. 3 quizzes\n   4. 3 programming assignments\n   5. 1 discussion prompt\n3. UI Frameworks (5h)\n   1. 12 videos\n   2. 8 readings\n   3. 5 quizzes\n   4. 2 ungraded labs\n4. End-of-Course Graded Assessment (2h)\n   1. 2 videos\n   2. 3 readings\n   3. 2 quizzes\n   4. 2 discussion prompts\n   5. 1 ungraded lab\n","n":0.09}}},{"i":18,"$":{"0":{"v":"Intro","n":1},"1":{"v":"Front-end developers work on what is visible by the app user, by using [[HTML]], [[CSS]], and [[JavaScript]].\n\nRules are split into 3 levels: junior, intermediate, and senior.\n\nBackend developers work on the behind-the-scenes portion of the web app, such as web servers, database, and architecture. They work with backend languages, databases, APIs, and web servers.\n\nBack-end development requires more knowledge and time.\n\nFull-stack developers are proficient with front-end and back-end work. This includes the planning, architecture, design, development, deployment, and maintenance of the website or app.\n\nFull-stack development roles are senior positions due to the high levels of experience required.\n","n":0.103}}},{"i":19,"$":{"0":{"v":"How the Web Works","n":0.5}}},{"i":20,"$":{"0":{"v":"How the Internet Works","n":0.5},"1":{"v":"2+ devices connect to each other, either wired or wireless, to form a [[network]].\n\n[[Network switches]] allow you to connect multiple devices, and even other networks to each other.\n\nThen, they connect to other network switches to form an [[interconnected network]], otherwise known as the internet.\n\nComputers that host content for the internet are called [[servers]], and the devices we use to connect to these servers are called [[clients]]. This is known as the [[client-server model]].\n","n":0.117}}},{"i":21,"$":{"0":{"v":"COM101 Speech Communication","n":0.577},"1":{"v":"This course introduces learners to the art of public speaking. Throughout the course, learners will write, organize, and develop the skills to deliver meaningful speeches, and grow in their ability to communicate effectively.\n","n":0.174}}},{"i":22,"$":{"0":{"v":"Writing Assignment 3","n":0.577},"1":{"v":"There are six points to an effective opening: establish a common ground between the speaker and the audience, set the tone for the speech, reinforce or establish the speaker’s credibility, arouse interest in the subject, take as much advantage of “the speaker’s grace period” as possible, and segue smoothly into the topic. Of these six points, President Ronald Reagan used five in his inaugural address on January 20, 1981.\n\nThroughout his speech, Former President Ronald Reagan used words like \"we,\" \"us,\" and \"our\" to bring him and the audience together as one group of people with common concerns and problems. However, when he spoke about the heroes that were saving and protecting the country, he used words, such as \"you\" and \"they\" to emphasize that the heroes of our country are the everyday people who work to provide food, jobs, and homes for all of us. Language like that successfully gave a sense of unity between the new president and the people.\n\nThe tone of the speech was also repeated and reinforced throughout President Reagan's speech. Several times, he addressed how the government needed to return to it's origins of being run by the people and not for it. And by doing that, the government would go back to depending on the people for guidance instead of the other way around.\n\nOverall, Former President Ronald Reagan's speech was very inspirational and captivating, and a good study for all speech writers and speakers.\n\nFor my speech, I think I will use a combination of novelty, question, and humorous openings. I could begin by showing some of the projects I've worked on and throw in a bit of humor as I explain why I chose that particular project. Or, perhaps I could start with asking the audience what they would do if they needed, or wanted, a new bag, and then explain how I make my own. Another idea would be to start with a humorous story of someone running around town looking for the perfect gift for their friend before realizing that the best gift she could give her friend was something she already owned. I will have to experiment to see which flows better for me.\n","n":0.053}}},{"i":23,"$":{"0":{"v":"Writing Assignment 1 - Public Speaking and Me","n":0.354},"1":{"v":"## My Experiences\n\nTo be honest, I don’t think I’ve done much public speaking, unless speaking in front of a small group of people counts. Most of the time I’m speaking publicly to a group, it’s either to children or a study group; in other words, I don’t usually speak to more than ten people. Either way, I tend to enjoy it. I like sharing my experiences and opinions on things, especially if it relates to apologetics or politics. In fact, I want to start my own discussion group and provide a place for people, mostly Christians, to talk about triggering or sensitive topics and learn what the Bible has to say about it. Part of this future plan would also include a Bible study hosted by myself centering around whatever the big discussion of the week was. This idea, about sharing my opinions on trigger topics to others, excites me and I can’t wait to be a leader in that area.\n\n## The Most Challenging Part\n\nEven though I love it, public speaking isn’t all smiles and giggles. The most challenging part for me is the backlash I get from close friends and family. Again, a lot of my public speaking includes personal experiences, politics and apologetics, and those are not exactly fun topics. There have been times when I’ve gotten into discussions with close friends who held very different political views than me and when I questioned those views, my opinions were pushed aside because I was too young and “inexperienced” in the topic. I try not to be an aggressive person when I’m arguing a point, but it’s frustrating how aggressive and defensive someone can get when you poke at their arguments and viewpoints. I understand that most of us don’t like being told that they’re wrong, but what’s wrong with asking “why” questions regarding your viewpoints? Plus, if I’m being respectful, and I’m younger than you, why can’t you do the same for me? Respect should be a two-way street.\n","n":0.055}}},{"i":24,"$":{"0":{"v":"Reading Reflection 3 - Summary of Chapter 5","n":0.354},"1":{"v":"The most important part of a speech is the opening. Simply put, the opening of a speech is the hundred or so seconds that you have captured the audience’s attention, and determines how much longer you will hold that attention. If you misuse these hundred or so seconds, your speech is almost guaranteed to be a bad one; but if properly utilized, you’ve done half of the work of delivering a good speech. There are around five main types of openings: reference, question, humorous, dramatic, and novelty openings. Some openings will fit into none of those categories, while others may be a combination of them; nevertheless, most tend to fall into one of them. The most common opening are reference openings, and those simply reference something familiar to the audience and use it as an entrance for the rest of the speech. Question openings use either a real or rhetorical question as a sort of topic question for the listeners to keep in mind as the speaker delivers his speech. A fun, but slightly difficult, type of opening is the humorous one. In a humorous opening, the speaker has to utilize the right tone and timing to make a point related to the topic being discussed; furthermore, it can also be used as an icebreaker to lighten the mood. Dramatic openings use suspense and/or surprising statements to quickly capture the attention of the audience. Lastly, novelty openings utilize storytelling, product samples, or past historical events to explain or add relation of the topic to the audience. Whichever opening you choose is up to you, but it’s important to chose one that will properly fit the subject and the speaker’s style of speaking.\n\nWhen you speak, you also want to make sure you include some variety in your speech. Essentially, your pitch, pace, pauses, volume, and word emphasis all work together to form variety and keep listeners engaged. Properly utilizing the five to eight different kinds of pitch will help you avoid sounding monotonous. This isn’t to be confused with the volume of one’s speech, that is more for dramatizing or riling up the audience. Likewise, maintaining a slow and relaxed pace allows the listeners to catch every word you speak. Furthermore, mastering pauses can add effect or give you time to consider the right answer for a question. Lastly, emphasizing certain words can draw attention to significant terms or sub-topics being discussed. Together, these five elements can take a seemingly boring speech and make it engaging and fun to listen to.\n","n":0.049}}},{"i":25,"$":{"0":{"v":"Persuasive Speech Prep","n":0.577},"1":{"v":"**Topic:** Linux is better than Windows for most people.\n\n**Proposed Thesis Statement:** Despite the popularity that Windows has had for the past few decades, Linux should be the best OS for most people because of its stability, security, flexibility, and customization.\n\n**Working Outline:**\n\n- Overview of what an operating system is.\n  - Definition\n  - Examples\n- What is Windows?\n  - Origins and Founder(s)\n- What is Linux?\n  - Origins and Founder(s)\n- Stability\n  - What makes an OS stable?\n  - How important is stability?\n  - How do you figure how stable an OS is?\n- Security\n  - What makes an OS secure?\n  - Does security change for different people?\n- Flexibility\n  - Levels of flexibility\n- Customization\n  - How much of the system can you customize?\n  - How easy is the customization process?\n- Cost\n- Hardware compatibility\n- Gaming\n  - Support\n  - Ease of use\n- Community and Support\n  - Community vs industry support\n  - Is it easy to find?\n  - How difficult are bugs to fix?\n  - How active is the community?\n- Who should absolutely try Linux?\n- Who should stick to Windows?\n","n":0.076}}},{"i":26,"$":{"0":{"v":"Informative Speech Prep","n":0.577},"1":{"v":"Greetings, ladies and gentlemen, my name is Yoela Olson, and I've come here to ask you a simple, yet seemingly complex, question—how would you make your own bag if faced with the task? **(PAUSE)** I'm sure some of you immediately had a thought similar to \"why would I do that when I could just buy one?\" However, take a moment to envision this scenario with me.\n\nYou're going about your day, heading back from school or work or some other environment that has stressed you out so badly that to protect the rest of humanity, you've resolved not to engage in any dumb conversations that will only lead to you making sarcastic comments or threatening to strangle someone. **(SIGH)** You pick up your favorite bag, the one that's worn out and *slightly* out-of-style, and SNAP! The strap pops right off, and the anger and frustration that you've been holding in all day explodes out of that beautiful little utility all of us share, the mouth. Your favorite bag, ruined, just like the rest of your day. You take a deep breath and continue on home, clutching your precious little treasure in your arms.\n\nOnce you get home, you proceed to start searching online for another bag that looks exactly like yours, or even better. Scroll, scroll, scroll, next page, some more scrolling, find something, the price is a little too much, check the reviews, of course there are too many bad reviews, go back to scrolling, more scrolling, this is officially pointless. You're never going to find what you want with a price tag you can actually afford that isn't going to end up ruined just like the first one, so why even try? You complain a bit more, maybe scroll a little, and then a memory hits you. What about all those  stories, reels, and shorts of those crafty people who make their own bags? How do they do it? You open another tab on your web browser and two hours later, your mind is full of crochet bags that look so professional and, of course, so cute. All the crocheters are saying that it's easy to make a bag once you get the hang of it, you really only need to learn one or two stitches and watch some tutorials. And the best part? You can make it look however you want. You want flowers? Go ahead, use whatever kind you want. What about making it blue and purple? Do you, have fun. If it can be designed, you can make it.\n\nNow, your Amazon cart is full of yarn, crochet hooks, and maybe a few books. And your YouTube watch later list? We're not going to talk about that list. Visions of you being that cool crochet friend who makes the coolest and cutest things are all over your vision board now. But, of course, there is one teeny, tiny problem—how do you exactly design a crochet bag? That, my friends, is what I'm going to teach you. And guess what? You don't need any fancy drawing skills or expensive programs.\n\nFirst, we will go over the different kinds of bag bases to start with, and the reasons why you might choose one over the other. Then, we will look at the different ways you can customize those bases to fit the shape that you want. Next comes the fun part, you will start to graph out the design and embellishments that you want on the bag itself. Lastly, I will give you some tips on what kinds of stitches to use for different kinds of circumstances.\n\nBy the end of this speech, I hope that you will have a good foundation for creating your own crochet bag designs for yourself and others to enjoy.\n\n---\n\n**Areas for Improvement:**\n\nWhile your introduction flows nicely, the transition from the storytelling portion to the instructional part could be smoother. Adding a transitional sentence, such as “So, how do you turn this situation around? Let me walk you through the process of creating your own crochet bag,” would help bridge the gap between the emotional setup and the step-by-step tutorial, making the shift more natural.\n\n~~When you mention starting with “different kinds of skeletons,” it’s unclear what this term means. Since this might be unfamiliar to some audience members, providing a brief explanation or an example would help clarify your point and keep everyone engaged. For instance, you could briefly explain what you mean by “skeletons” in the context of crochet design, allowing your audience to understand the foundation before you move forward.~~\n\nFinally, your conclusion could be strengthened by briefly reminding the audience of the benefits of designing their crochet bag. Mentioning how this process allows for creativity, saves money, and offers customization would reinforce the personal connection you built in your introduction and leave the audience with a clear sense of why this skill is valuable.\n","n":0.035}}},{"i":27,"$":{"0":{"v":"Prose","n":1},"1":{"v":"Any form of written language that is written like everyday speech can be known as prose. In my free time, I like to write my own type of prose, including poetry, short stories, and other fiction.\n","n":0.167}}},{"i":28,"$":{"0":{"v":"Tips and Advice","n":0.577},"1":{"v":"## Playlists\n\n- [New Writers: Start Here - YouTube](https://youtube.com/playlist?list=PLV6pMftb_QTlFALRRV8oSFPhc4tiU91oZ&si=CESESG3B8IK2cZPY)\n\n## General Tips & Tricks\n\n- [Ten Weird Writing Tips That Actually Work - YouTube](https://youtu.be/G_V_5a-J9Us?si=Mo2Rv0WbSVqngEaP)\n- [Why I love Obsidian for writing novels and fiction worldbuilding - YouTube](https://youtu.be/mzj91fYrUL0?si=xgKpCC3Dy8UHx3s1)\n- [Fantasy fiction writing using Obsidian - A discussion with Eleanor Konik - YouTube](https://youtu.be/kfyA1UTo1sI?si=QL1fpUVb9cJTE-L9)\n\n## Plotting & Outlining Methods\n\n### 27-Chapter 💖\n\n- [HOW TO OUTLINE - 3 act 9 block 27 chapter example - YouTube](https://youtu.be/fe3eodLF_Uo?si=MfcHf4wfuH48k2rH)\n- [The Ultimate Guide to Outlining Your Story: Exploring the 27-Chapter Outline, From Kat O&#39;Keeffe - YouTube](https://youtu.be/Y3wua1KWRVI?si=G-2ucsHFfqh4WsGA)\n- [The Ultimate Guide to Outlining Your Story: Exploring the 27-Chapter Outline—UPDATED - YouTube](https://youtu.be/RNV--FikzF0?si=zHBcy_JinlNZ-zwr)\n\n### Save the Cat\n\n- [How to Write a Novel in 15 Steps with the Save the Cat! Beat Sheet - YouTube](https://youtu.be/k8EfEEjbwGk?si=-Q1TkAttNqhammJx)\n\n## Dialogue\n\n- [The Key to Writing Freakishly Good Dialogue - Video Essay - YouTube](https://youtu.be/-AhtKvgy6MA?si=U9XBRzot0MdRcWCh)\n  - summarize important info **FIRST**\n  - characters speak through **FILTERS**\n  - know the **personality** of your characters, even the minor ones\n  - every piece of dialogue should have a **purpose** and a **goal**\n  - disagreement =/ conflict; use the plot to **trigger** conflict\n  - **allegories** are great ways to have dialogue\n  - “yes, and…” is also helpful\n- [Dialogue Mistakes New Writers Make ❌ Avoid These Cringeworthy Cliches!! - YouTube](https://youtu.be/-e5Y2yH7RhQ?si=BeHzSF7Z0vsY77C8)\n  - characters **don’t** know exactly how they’re feeling, so **they don’t tell you**\n  - do use *subtext* and **show** readers what the character is feeling\n  - **script format** might be helpful for your first manuscript\n  - don’t make all your characters **sound** the same (grammar, slang, canter, etc.)\n  - don’t overuse [[dialogue tags]]\n  - keep your dialogue fast-paced & to the point\n","n":0.062}}},{"i":29,"$":{"0":{"v":"Fiction","n":1},"1":{"v":"\n> Fiction is any creative work, chiefly any narrative work, portraying individuals, events, or places that are imaginary or in ways that are imaginary. Fictional portrayals are thus inconsistent with history, fact, or plausibility. In a traditional narrow sense, \"fiction\" refers to written narratives in prose – often referring specifically to novels, novellas, and short stories. More broadly, however, fiction encompasses imaginary narratives expressed in any medium, including not just writings but also live theatrical performances, films, television programs, radio dramas, comics, role-playing games, and video games.\n>\n> [Wikipedia](https://en.wikipedia.org/wiki/Fiction)\n","n":0.107}}},{"i":30,"$":{"0":{"v":"Light in the Shadows","n":0.5},"1":{"v":"A young girl gets gang-rapped, ends up pregnant, and finds healing through the help of a Father.\n\nThis isn’t a romance story, it’s a story about a girl who learns how to recover from trauma.\n","n":0.171}}},{"i":31,"$":{"0":{"v":"Outline","n":1},"1":{"v":"## Act 1 - Setup\n\n### Block 1 - Introducing the main characters\n\n#### 1. INTRODUCTION - Intro to set up their ordinary world\n\nMC is going about her day, heading to work.\n\n#### 2. INCIDENT - Inciting incident to start of the story\n\nAs she’s heading home, she gets nabbed by three guys and they rape her.\n\n#### 3. FALL OUT - Immediate reaction to the incident\n\nShe escapes by fighting her way out.\n\n### Block 2 - Life gets disrupted\n\n#### 4. REACTION - MC reacts & reflects on long-term impacts\n\nAfterward, she tries to return to her normal life and ignore what happened to her.\n\n#### 5. ACTION - MC takes action\n\nMC goes back to work at the library.\n\n#### 6. CONSEQUENCE - Immediate consequences of MC’s actions\n\nSeveral times, she experiences panic attacks.\n\n### Block 3 - Time to change\n\n#### 7. PRESSURE - MC’s Life has changed, creating pressure & stress\n\nShe sees one of them and freaks out that they might get her again.\n\n#### 8. PLOT TWIST - The first pinch or plot twist occurs\n\nOne of the guys who molested her ends up being someone important and influential.\n\n#### 9. PUSH → - Due to the plot twist, the MC is pushed into the new world\n\nAbout two weeks after her rape, she finds out she’s pregnant.\n\n## Act 2 - Conflict\n\n### Block 4 - Settle into new world\n\n#### 10. NEW WORLD - Intro to the new world. What’s changed? MC’s feelings?\n\nMC is scared. She doesn’t want an abortion, but she doesn’t know how she can raise a kid by herself. And what if the guys find out?\n\n#### 11. FUN & GAMES - MC takes a break, has a little fun\n\nBoard game day at the library! And she actually has a little fun AND meets SC.\n\n#### 12. JUXTAPOSITION - Comparison between the past world and the present one\n\nMC wishes her life could go back to “normal” but the stress and panic make it impossible to forget and move on.\n\n### Block 5 - Main conflict\n\n#### 13. BUILD UP - Midpoint is approaching!\n\nMC finds a pregnancy center and decides to get an ultrasound.\n\n#### 14. MIDPOINT - The main midpoint conflict\n\nThere, she runs into SC again and with his reassurance, she decides to keep the baby.\n\n#### 15. REVERSAL - Immediate reaction or consequence of the midpoint\n\nSC is very helpful, but all the excitement and planning required is overwhelming.\n\n### Block 6 - Find the end-goal\n\n#### 16. CONSEQUENCE - MC reflects on long-term impacts of midpoint\n\nMC does a lot of research on motherhood and it's all so daunting.\n\n#### 17. TRIALS - MC takes action, but due to the enormity of the task, stuff go wrong\n\nAC reaches out to her again, touches her, threatens her, all that stuff.\n\n#### 18. DEDICATED - Despite setbacks, MC decides to succeed no matter what\n\nDespite her fear, MC hatches a plan to keep her pregnancy secret.\n\n## Act 3 - Resolution\n\n### Block 7 - Darkest moment\n\n#### 19. CALM BEFORE THE STORM - Stuff seem to calm down, but the tension is still there\n\nMC and SC spend quality time together.\n\n#### 20. PLOT TWIST - MC experiences something completely unexpected\n\n**EITHER** MC is pregnant with twins **OR** AC finds out.\n\n#### 21. DARKEST MOMENT - Success seems impossible\n\n**EITHER** she freaks out because she can’t take care of twins and hide them at the same time! **AND/OR** She has a huge PTSD attack and ends up in the hospital.\n\n### Block 8 - Motivated\n\n#### 22. POWER WITHIN - MC remembers their desire to succeed & finds their inner power\n\nSC encourages her, and together they continue with the plans.\n\n#### 23. ACTION/RALLY - MC takes action, plot lines begin to converge\n\n????\n\n#### 24. CONVERGE - The final battle is approaching!\n\nAC breaks into MC’s place and confronts her.\n\n### Block 9 - Finale\n\n#### 25. BATTLE - The finale! MC has one last battle\n\nMC and AC fight, then SC shows up and it gets bloody.\n\n#### 26. CLIMAX - MC takes action to resolve the problem from the midpoint\n\nSC’s mom shows up with the police, everyone goes to the hospital, and AC is arrested.\n\n#### 27. RESOLUTION - Immediate reaction to MC’s decision\n\nEveryone is going to be fine.\n","n":0.039}}}]}
